Revit 2024 API
ParameterTypeId.TemplateName Property
 "Template"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId TemplateName { get; }
Visual Basic
Public Shared ReadOnly Property TemplateName As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ TemplateName {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace